In [3]:
print("hello World, all imported!")
import pandas as pd
import matplotlib as plt
import seaborn as sns

hello World, all imported!

In [4]:
df = pd.read_csv("C:/Users/kelvi/OneDrive/Documents/Messy_Employee_dataset.csv", encoding = 'latin-1')

In [7]:
df.head()
df.columns = df.columns.str.lower().str.replace('_','').str.strip()

In [8]:
df.head()

,employeeid,firstname,lastname,age,departmentregion,status,joindate,salary,email,phone,performancescore,remotework
0,EMP1000,Bob,Davis,25.0,DevOps-California,Active,4/2/2021,59767.65,bob.davis@example.com,-1651623197,Average,True
1,EMP1001,Bob,Brown,NaN,Finance-Texas,Active,7/10/2020,65304.66,bob.brown@example.com,-1898471390,Excellent,True
2,EMP1002,Alice,Jones,NaN,Admin-Nevada,Pending,12/7/2023,88145.90,alice.jones@example.com,-5596363211,Good,True
3,EMP1003,Eva,Davis,25.0,Admin-Nevada,Inactive,11/27/2021,69450.99,eva.davis@example.com,-3476490784,Good,True
4,EMP1004,Frank,Williams,25.0,Cloud Tech-Florida,Active,1/5/2022,109324.61,frank.williams@example.com,-1586734256,Poor,False

In [9]:
df.describe()

              age         salary         phone
count  809.000000     996.000000  1.020000e+03
mean    32.484549   85155.056396 -4.942253e+09
std      5.656860   19873.727918  2.817326e+09
min     25.000000   50047.320000 -9.994973e+09
25%     25.000000   68392.487500 -7.341992e+09
50%     30.000000   85547.870000 -4.943997e+09
75%     40.000000  100974.027500 -2.520391e+09
max     40.000000  119971.650000 -3.896086e+06

In [10]:
df

,employeeid,firstname,lastname,age,departmentregion,status,joindate,salary,email,phone,performancescore,remotework
0,EMP1000,Bob,Davis,25.0,DevOps-California,Active,4/2/2021,59767.65,bob.davis@example.com,-1651623197,Average,True
1,EMP1001,Bob,Brown,NaN,Finance-Texas,Active,7/10/2020,65304.66,bob.brown@example.com,-1898471390,Excellent,True
2,EMP1002,Alice,Jones,NaN,Admin-Nevada,Pending,12/7/2023,88145.90,alice.jones@example.com,-5596363211,Good,True
3,EMP1003,Eva,Davis,25.0,Admin-Nevada,Inactive,11/27/2021,69450.99,eva.davis@example.com,-3476490784,Good,True
4,EMP1004,Frank,Williams,25.0,Cloud Tech-Florida,Active,1/5/2022,109324.61,frank.williams@example.com,-1586734256,Poor,False
...,...,...,...,...,...,...,...,...,...,...,...,...
1015,EMP2015,David,Miller,30.0,HR-California,Active,8/19/2023,NaN,david.miller@example.com,-3546212759,Good,True
1016,EMP2016,David,Johnson,30.0,Cloud Tech-Texas,Inactive,11/7/2021,100215.06,david.johnson@example.com,-2508261122,Good,True
1017,EMP2017,Charlie,Williams,40.0,Finance-New York,Active,10/4/2023,114587.11,charlie.williams@example.com,-1261632487,Average,False
1018,EMP2018,Alice,Garcia,30.0,HR-Florida,Inactive,12/16/2024,71318.79,alice.garcia@example.com,-8995729892,Good,True
1019,EMP2019,Heidi,Jones,30.0,DevOps-Illinois,Pending,2/22/2021,77764.24,heidi.jones@example.com,-7629745492,Average,False

In [11]:
df.tail()

,employeeid,firstname,lastname,age,departmentregion,status,joindate,salary,email,phone,performancescore,remotework
1015,EMP2015,David,Miller,30.0,HR-California,Active,8/19/2023,NaN,david.miller@example.com,-3546212759,Good,True
1016,EMP2016,David,Johnson,30.0,Cloud Tech-Texas,Inactive,11/7/2021,100215.06,david.johnson@example.com,-2508261122,Good,True
1017,EMP2017,Charlie,Williams,40.0,Finance-New York,Active,10/4/2023,114587.11,charlie.williams@example.com,-1261632487,Average,False
1018,EMP2018,Alice,Garcia,30.0,HR-Florida,Inactive,12/16/2024,71318.79,alice.garcia@example.com,-8995729892,Good,True
1019,EMP2019,Heidi,Jones,30.0,DevOps-Illinois,Pending,2/22/2021,77764.24,heidi.jones@example.com,-7629745492,Average,False

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1020 entries, 0 to 1019
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   employeeid        1020 non-null   object
 1   firstname         1020 non-null   object
 2   lastname          1020 non-null   object
 3   age               809 non-null    float64
 4   departmentregion  1020 non-null   object
 5   status            1020 non-null   object
 6   joindate          1020 non-null   object
 7   salary            996 non-null    float64
 8   email             1020 non-null   object
 9   phone             1020 non-null   int64
 10  performancescore  1020 non-null   object
 11  remotework        1020 non-null   bool
dtypes: bool(1), float64(2), int64(1), object(8)
memory usage: 88.8+ KB

In [13]:
df.duplicated().sum()

np.int64(0)

In [14]:
df.nunique()

employeeid          1020
firstname              8
lastname               8
age                    4
departmentregion      36
status                 3
joindate             760
salary               978
email                 64
phone               1020
performancescore       4
remotework             2
dtype: int64

In [15]:
df.describe()

              age         salary         phone
count  809.000000     996.000000  1.020000e+03
mean    32.484549   85155.056396 -4.942253e+09
std      5.656860   19873.727918  2.817326e+09
min     25.000000   50047.320000 -9.994973e+09
25%     25.000000   68392.487500 -7.341992e+09
50%     30.000000   85547.870000 -4.943997e+09
75%     40.000000  100974.027500 -2.520391e+09
max     40.000000  119971.650000 -3.896086e+06

In [16]:
df.isnull().sum()

employeeid            0
firstname             0
lastname              0
age                 211
departmentregion      0
status                0
joindate              0
salary               24
email                 0
phone                 0
performancescore      0
remotework            0
dtype: int64

In [17]:
df.head()

,employeeid,firstname,lastname,age,departmentregion,status,joindate,salary,email,phone,performancescore,remotework
0,EMP1000,Bob,Davis,25.0,DevOps-California,Active,4/2/2021,59767.65,bob.davis@example.com,-1651623197,Average,True
1,EMP1001,Bob,Brown,NaN,Finance-Texas,Active,7/10/2020,65304.66,bob.brown@example.com,-1898471390,Excellent,True
2,EMP1002,Alice,Jones,NaN,Admin-Nevada,Pending,12/7/2023,88145.90,alice.jones@example.com,-5596363211,Good,True
3,EMP1003,Eva,Davis,25.0,Admin-Nevada,Inactive,11/27/2021,69450.99,eva.davis@example.com,-3476490784,Good,True
4,EMP1004,Frank,Williams,25.0,Cloud Tech-Florida,Active,1/5/2022,109324.61,frank.williams@example.com,-1586734256,Poor,False

In [18]:
df.set_index('employeeid',inplace = True)

In [19]:
print(df.index)

Index(['EMP1000', 'EMP1001', 'EMP1002', 'EMP1003', 'EMP1004', 'EMP1005',
       'EMP1006', 'EMP1007', 'EMP1008', 'EMP1009',
       ...
       'EMP2010', 'EMP2011', 'EMP2012', 'EMP2013', 'EMP2014', 'EMP2015',
       'EMP2016', 'EMP2017', 'EMP2018', 'EMP2019'],
      dtype='object', name='employeeid', length=1020)

In [20]:
df['phone'] = df['phone'].astype(str)

In [21]:
median_age = df['age'].median()
df['age'].fillna(median_age,inplace=True)

C:\Users\kelvi\AppData\Local\Temp\ipykernel_20300\2440875822.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['age'].fillna(median_age,inplace=True)

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1020 entries, EMP1000 to EMP2019
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   firstname         1020 non-null   object
 1   lastname          1020 non-null   object
 2   age               1020 non-null   float64
 3   departmentregion  1020 non-null   object
 4   status            1020 non-null   object
 5   joindate          1020 non-null   object
 6   salary            996 non-null    float64
 7   email             1020 non-null   object
 8   phone             1020 non-null   object
 9   performancescore  1020 non-null   object
 10  remotework        1020 non-null   bool
dtypes: bool(1), float64(2), object(8)
memory usage: 88.7+ KB

In [30]:
df['phone'] = df['phone'].str.replace(r'\D','',regex=True)

In [31]:
print(df['phone'])

employeeid
EMP1000    1651623197
EMP1001    1898471390
EMP1002    5596363211
EMP1003    3476490784
EMP1004    1586734256
              ...
EMP2015    3546212759
EMP2016    2508261122
EMP2017    1261632487
EMP2018    8995729892
EMP2019    7629745492
Name: phone, Length: 1020, dtype: object

In [43]:
df['region']=df['departmentregion'].str.slice(-10)

In [44]:
print(df['region'])

employeeid
EMP1000    California
EMP1001    ance-Texas
EMP1002    min-Nevada
EMP1003    min-Nevada
EMP1004    ch-Florida
              ...
EMP2015    California
EMP2016    Tech-Texas
EMP2017    e-New York
EMP2018    HR-Florida
EMP2019    s-Illinois
Name: region, Length: 1020, dtype: object

In [45]:
df['joindate']=pd.to_datetime(df['joindate'], errors='coerce')

In [47]:
print(df['joindate'])

employeeid
EMP1000   2021-04-02
EMP1001   2020-07-10
EMP1002   2023-12-07
EMP1003   2021-11-27
EMP1004   2022-01-05
             ...
EMP2015   2023-08-19
EMP2016   2021-11-07
EMP2017   2023-10-04
EMP2018   2024-12-16
EMP2019   2021-02-22
Name: joindate, Length: 1020, dtype: datetime64[ns]

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1020 entries, EMP1000 to EMP2019
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   firstname         1020 non-null   object
 1   lastname          1020 non-null   object
 2   age               1020 non-null   float64
 3   departmentregion  1020 non-null   object
 4   status            1020 non-null   object
 5   joindate          1020 non-null   datetime64[ns]
 6   salary            996 non-null    float64
 7   email             1020 non-null   object
 8   phone             1020 non-null   object
 9   performancescore  1020 non-null   object
 10  remotework        1020 non-null   bool
 11  region            1020 non-null   object
dtypes: bool(1), datetime64[ns](1), float64(2), object(8)
memory usage: 96.6+ KB

In [49]:
df.describe()

               age                       joindate         salary
count  1020.000000                           1020     996.000000
mean     31.970588  2022-07-26 12:53:38.823529472   85155.056396
min      25.000000            2020-01-01 00:00:00   50047.320000
25%      30.000000            2021-04-12 06:00:00   68392.487500
50%      30.000000            2022-08-09 12:00:00   85547.870000
75%      35.000000            2023-10-31 12:00:00  100974.027500
max      40.000000            2024-12-29 00:00:00  119971.650000
std       5.136901                            NaN   19873.727918

In [50]:
df.to_csv('cleaned_employee_data.csv', index = True)